import React, { Component } from 'react';
import styles from './AllNewsPage.css';
import classNames from 'classnames';
import { connect } from 'react-redux';
import NewsContent from '../../components/NewsContent/NewsContent';
import PropTypes from 'prop-types';

const CATEGORY_HEIGHT = 58;
const NEWS_CATEGORY_LIST = [
    {
        id: 'Всі новини',
        newsList: [
            {
                id: '11',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 16),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '12',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 17),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '13',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 18),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '14',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 19),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '15',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 20),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '16',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 21),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '17',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 22),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '18',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 23),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '19',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 24),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '110',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 25),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '111',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 26),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '112',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 27),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '113',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 28),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            }
        ]
    },
    {
        id: 'Укрaїна',
        newsList: [
            {
                id: '21',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 21),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '22',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 22),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            }
        ]
    },
    {
        id: 'Світ',
        newsList: [
            {
                id: '31',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 22),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            }
        ]
    }
];
const mapStateToProps = () => {
    return {
        news: NEWS_CATEGORY_LIST
    };
};

class AllNewsPage extends Component {
    static propTypes = {
        news: PropTypes.array
    };

    static defaultProps = {
        news: []
    };

    constructor (...args) {
        super(...args);
        const { news } = this.props;

        const newsArr = news.map(newsCategory => {
            return { ...newsCategory, opened: false };
        });
        newsArr[0].opened = true;

        this.state = {
            news: newsArr,
            newsCategoryRendered: newsArr[0].newsList,
            activeCategoryIndex: 0,
            mobileMenuListVisible: false
        };
    }

    handleCategoryClick = i => () => {
        const { news } = this.props;
        const newNews = news.map(newsCategory => {
            return { ...newsCategory, opened: false };
        });
        newNews[i].opened = !news[i].opened;

        this.setState({
            news: newNews,
            newsCategoryRendered: i === 0 ? newNews[0].newsList : newNews[i].newsList,
            activeCategoryIndex: i,
            mobileMenuListVisible: !this.state.mobileMenuListVisible
        });
    };

    handleOpenMenuList = () => {
        this.setState({ mobileMenuListVisible: !this.state.mobileMenuListVisible });
    };

    render () {
        const { news, newsCategoryRendered, activeCategoryIndex, mobileMenuListVisible } = this.state;

        return <section className={styles.newsContainer}>
            <div className={styles.gridContainer}>
                <div className={classNames(styles.column, styles.column1)}/>
                <div className={classNames(styles.column, styles.column2)}/>
                <div className={classNames(styles.column, styles.column3)}/>
                <div className={classNames(styles.column, styles.column4)}/>
            </div>
            <div className={styles.newsContentContainer}>
                <div className={styles.titleContainer}>
                    <div className={styles.rectangleGreen}/>
                    <div className={styles.title}>Останні оновлення</div>
                </div>
                <div className={styles.newsContent}>
                    <NewsContent newsCategoryRendered={newsCategoryRendered}/>
                </div>
            </div>
            <div className={styles.newsMenuContainer}>
                <ul>
                    {
                        news.map((newsCategory, i) =>
                            <li key={i}>
                                <div className={styles.newsCategory} onClick={this.handleCategoryClick(i)}>
                                    <div className={styles.newsCategoryTitle}>
                                        <div className={classNames(!news[i].opened
                                            ? styles.rectangleGreenInvisible
                                            : styles.rectangleGreen)}
                                        />
                                        <div className={styles.categoryTitle}>{newsCategory.id}</div>
                                    </div>
                                </div>
                            </li>
                        )
                    }
                </ul>
            </div>
            <div className={styles.newsMenuContainerMobile}>
                <div className={styles.mobileMenuContainer}>
                    <div className={styles.activeCategory}>{news[activeCategoryIndex].id}</div>
                    <div className={classNames(styles.arrowButton, {
                        [styles.arrowButtonReverse]: mobileMenuListVisible
                    })} onClick={this.handleOpenMenuList}>
                        <img className={styles.arrow} src='/src/apps/client/ui/pages/NewsPage/images/downArrowGreen.png' alt='arrow'/>
                    </div>
                </div>
                {
                    <ul className={classNames(styles.categoriesList)} style={{ height: `${!mobileMenuListVisible ? 0 : CATEGORY_HEIGHT * news.length}px` }}>
                        {
                            news.map((newsCategory, i) =>
                                <li key={i}>
                                    <div className={classNames(styles.newsCategoryMobile, {
                                        [styles.newsCategoryMobileAnimated]: mobileMenuListVisible
                                    })}
                                    onClick={this.handleCategoryClick(i)}
                                    >
                                        <div className={styles.newsCategoryTitleMobile}
                                        >
                                            <div className={styles.categoryTitleMobile}>{newsCategory.id}</div>
                                        </div>
                                    </div>
                                </li>
                            )
                        }
                    </ul>
                }
            </div>
        </section>;
    }
}

export default connect(mapStateToProps)(AllNewsPage);
