import React, { Component } from 'react';
import styles from './NewsPage.css';
import classNames from 'classnames';
import { connect } from 'react-redux';
import PropTypes from 'prop-types';
import getDateFormatted from '../../../../../../utils/getDateFormatted';
import { withRouter, matchPath } from 'react-router-dom';
import find from '@tinkoff/utils/array/find';

const TABLET_WIDTH = 780;
const CATEGORY_HEIGHT = 58;
const PRODUCT_PATH = '/:news/:id';
const NEWS_CATEGORY_LIST = [
    {
        id: 'Всі новини',
        newsList: [
            {
                id: '11',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 16),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '12',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 17),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '13',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 18),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '14',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 19),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '15',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 20),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '16',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 21),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '17',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 22),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '18',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 23),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '19',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 24),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '110',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 25),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '111',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 26),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '112',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 27),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '113',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 28),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            }
        ]
    },
    {
        id: 'Укрaїна',
        newsList: [
            {
                id: '21',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 21),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            },
            {
                id: '22',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 22),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            }
        ]
    },
    {
        id: 'Світ',
        newsList: [
            {
                id: '31',
                url: 'https://www.muayene.com/images/recycle.jpg',
                date: +new Date(2019, 7, 22),
                title: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК',
                text:
                // eslint-disable-next-line max-len
                    `Голова Української Пакувально-Екологічної Коаліції (УКРПЕК) Володимир Слабий прокоментував вольове рішення Європейського парламенту щодо поступового введення заборони використання одноразових виробів з пластику (посуду, ватних паличок, пакетів, соломинок для напоїв, столового приладдя тощо). На думку керівника УКРПЕК, така ініціатива здатна з роками значно покращити екологічну ситуацію, проте різких кроків у цьому напрямку краще уникати. Безумовно, рівень забруднення довкілля треба зменшувати, але при цьому заборону пластикових виробів слід впроваджувати поступово. Форсування подій неминуче призведе до величезних економічних втрат, зокрема до скорочення робочих місць і масового закриття підприємств, які виробляють ці групи товарів. «Директива ЄС передбачає, що протягом двох років країни Європейського Союзу запровадять це законодавство у себе. Для цього вони повинні все порахувати та мати чітке розуміння того, які саме види можна замінити, які є перспективні технології. На це дають два роки. Ми, звісно, хочемо отак раз – і відмінити, але ж повинні розуміти, що є люди, підприємства, колективи, які зараз випускають цю продукцію», – вважає Володимир Слабий. Нагадаємо, парламент ЄС підтримав пропозиції Європейської комісії з 2021 року ввести заборону використання окремих груп і найменувань товарів із пластику, які забруднюють навколишнє середовище. Згідно з оприлюдненими планами з 2025 року такі пластикові вироби, як  пляшки для напоїв, одноразові коробки, харчові контейнери усіх типів, необхідно буде окремо збирати та відправляти на повторну переробку обсягом не менш як 90% від загальної кількості. Більш того, 2030 року уся пластикова упаковка на ринках країн Європейського Союзу має стати перероблюваною. Зі свого боку держави – члени ЄС повинні найближчим часом підготувати чіткі національні стратегії заохочення населення до використання багаторазових товарів і таких, які є придатними для подальшої переробки.`
            }
        ]
    }
];
const mapStateToProps = ({ application }) => {
    return {
        news: NEWS_CATEGORY_LIST,
        mediaWidth: application.media.width
    };
};

class NewsPage extends Component {
    static propTypes = {
        news: PropTypes.array,
        location: PropTypes.object.isRequired,
        mediaWidth: PropTypes.number.isRequired
    };

    static defaultProps = {
        news: []
    };

    constructor (...args) {
        super(...args);

        this.state = this.getNewState();
    }

    getNewState = (props = this.props) => {
        const { location: { pathname }, news } = props;
        const match = matchPath(pathname, { path: PRODUCT_PATH, exact: true });
        let allNews = news.map((category) =>
            category.newsList.map((news) =>
                news
            )
        );
        allNews = allNews.reduce(function (previousValue, currentValue) {
            return previousValue.concat(currentValue);
        }, []);
        const article = find(news => news.id === match.params.id, allNews);
        const newsArr = news.map(newsCategory => {
            return { ...newsCategory, opened: false };
        });

        this.notFoundPage = !article;

        return {
            article: article,
            articleId: match.params.id,
            news: newsArr,
            activeCategoryIndex: 0,
            mobileMenuListVisible: false,
            pageLoaded: false
        };
    };

    componentDidMount () {
        const { news } = this.state;
        const newsArr = news;
        newsArr[0].opened = true;

        this.setState({ pageLoaded: true, news: newsArr });
    }

    handleCategoryClick = i => () => {
        const { news } = this.props;
        const newNews = news.map(newsCategory => {
            return { ...newsCategory, opened: false };
        });
        newNews[i].opened = !this.state.news[i].opened;

        this.setState({
            news: newNews,
            activeCategoryIndex: i,
            mobileMenuListVisible: !this.state.mobileMenuListVisible
        });
    };

    handleOpenMenuList = () => {
        this.setState({ mobileMenuListVisible: !this.state.mobileMenuListVisible });
    };

    render () {
        const { news, article, activeCategoryIndex, mobileMenuListVisible, pageLoaded } = this.state;
        const { mediaWidth } = this.props;
        const isDesktop = mediaWidth > TABLET_WIDTH;

        if (this.notFoundPage) {
            return <div className={styles.pageNotFound}>404</div>;
        }

        return <section className={styles.newsContainer}>
            <div className={styles.gridContainer}>
                <div className={classNames(styles.column, styles.column1)}/>
                <div className={classNames(styles.column, styles.column2)}/>
                <div className={classNames(styles.column, styles.column3)}/>
                <div className={classNames(styles.column, styles.column4)}/>
            </div>
            <div className={styles.newsContentContainer}>
                <div className={classNames(styles.titleContainer, {
                    [styles.titleContainerAnimated]: pageLoaded
                })}>
                    <div className={styles.rectangleGreen}/>
                    <div className={styles.title}>Останні оновлення</div>
                </div>
                <div className={styles.newsContent}>
                    <div className={classNames(styles.newsCover, {
                        [styles.newsCoverAnimated]: pageLoaded
                    })}
                    style={{ top: `${isDesktop ? 100 : !mobileMenuListVisible ? 300 : 300 + CATEGORY_HEIGHT * news.length}px` }}>
                        <img className={styles.coverImage} src={article.url} alt={article.title}/>
                    </div>
                    <div className={classNames(styles.news, {
                        [styles.newsAnimated]: pageLoaded
                    })}>
                        <div className={classNames(styles.newsDate, {
                            [styles.newsDateAnimated]: pageLoaded
                        })}>
                            {getDateFormatted(article.date, 'ua')}
                        </div>
                        <div className={classNames(styles.newsTitle, {
                            [styles.newsTitleAnimated]: pageLoaded
                        })}>
                            {article.title}
                        </div>
                        <div className={classNames(styles.newsText, {
                            [styles.newsTextAnimated]: pageLoaded
                        })}>
                            {article.text}
                        </div>
                    </div>
                </div>
                <div className={styles.nextNews}>
                    <div className={styles.nextNewsInfo}>
                        <div className={styles.nextNewsHeader}>
                            <div className={styles.next}>Наступна новина</div>
                            <div className={styles.nextNewsDate}>17 cерпня 2019</div>
                        </div>
                        <div className={styles.nextNewsTitle}>Українська Пакувально-Екологічна Коаліція нагадала про потребу сортувати побутові відходи</div>
                    </div>
                    <div className={styles.nextNewsButton}>
                        <img className={styles.arrowIcon}
                            src={ isDesktop
                                ? '/src/apps/client/ui/pages/NewsPage/images/downArrowGreen.png'
                                : '/src/apps/client/ui/pages/NewsPage/images/downArrowBlack.png'
                            }
                            alt='arrow'/>
                    </div>
                </div>
            </div>
            <div className={classNames(styles.newsMenuContainer, {
                [styles.newsMenuContainerAnimated]: pageLoaded
            })}>
                <ul>
                    {
                        news.map((newsCategory, i) =>
                            <li key={i}>
                                <div className={styles.newsCategory} onClick={this.handleCategoryClick(i)}>
                                    <div className={styles.newsCategoryTitle}>
                                        <div className={styles.categoryTitle}>{newsCategory.id}</div>
                                    </div>
                                    <div className={classNames(!news[i].opened ? styles.arrowButtonDown : styles.arrowButtonUp)}>
                                        <img
                                            className={styles.categoryArrowIcon}
                                            src='/src/apps/client/ui/pages/NewsPage/images/downArrowBlack.png'
                                            alt='arrow'
                                        />
                                    </div>
                                </div>
                                <ul className={classNames(styles.categoryNewsList, {
                                    [styles.categoryNewsListAnimated1x]: news[i].opened && newsCategory.newsList.length === 1,
                                    [styles.categoryNewsListAnimated2x]: news[i].opened && newsCategory.newsList.length === 2,
                                    [styles.categoryNewsListAnimated3x]: news[i].opened && newsCategory.newsList.length >= 3
                                })}>
                                    {
                                        newsCategory.newsList.map((newsCard, j) =>
                                            <li className={classNames(styles.newsCardContainer, {
                                                [styles.newsCardContainerAnimated]: news[i].opened
                                            })}
                                            key={j} style={{ transitionDelay: `${j * 0.2}s` }}>
                                                <div className={styles.newsDateMenu}>{getDateFormatted(newsCard.date, 'ua')}</div>
                                                <div className={styles.newsTitleMenu}>{newsCard.title}</div>
                                            </li>
                                        )
                                    }
                                </ul>
                            </li>
                        )
                    }
                </ul>
            </div>
            <div className={styles.newsMenuContainerMobile}>
                <div className={styles.mobileMenuContainer}>
                    <div className={styles.activeCategory}>{news[activeCategoryIndex].id}</div>
                    <div className={classNames(styles.arrowButton, {
                        [styles.arrowButtonReverse]: mobileMenuListVisible
                    })} onClick={this.handleOpenMenuList}>
                        <img className={styles.arrow} src='/src/apps/client/ui/pages/NewsPage/images/downArrowGreen.png' alt='arrow'/>
                    </div>
                </div>
                {
                    <ul className={classNames(styles.categoriesList)} style={{ height: `${!mobileMenuListVisible ? 0 : CATEGORY_HEIGHT * news.length}px` }}>
                        {
                            news.map((newsCategory, i) =>
                                <li key={i}>
                                    <div className={classNames(styles.newsCategoryMobile, {
                                        [styles.newsCategoryMobileAnimated]: mobileMenuListVisible
                                    })}
                                    onClick={this.handleCategoryClick(i)}
                                    >
                                        <div className={styles.newsCategoryTitleMobile}>
                                            <div className={styles.categoryTitleMobile}>{newsCategory.id}</div>
                                        </div>
                                    </div>
                                </li>
                            )
                        }
                    </ul>
                }
            </div>
        </section>;
    }
}

export default withRouter(connect(mapStateToProps)(NewsPage));
