import { SET_ABOUT } from '../types/types';

const initialState = {
    aboutList: [
        {
            img: `/src/apps/client/ui/components/About/files/can.png`,
            text: {
                ua: `Українська Пакувально-Екологічна Коаліція (УКРПЕК) була створена у 1999 році як некомерційне
                (неприбуткове) об’єднання юридичних осіб. Метою цього об’єднання було прагнення компаній,
                що займаються виробництвом та імпортом упаковки і товарів в упаковці,
                підвищити стандарти екологічної безпеки, впровадити в Україні європейський досвід поводження з відходами,
                розповсюдити основи сучасної споживчої культри у сфері поводження з упаковкою та її відходами.`,
                en: `Українська Пакувально-Екологічна Коаліція (УКРПЕК) була створена у 1999 році як некомерційне
                (неприбуткове) об’єднання юридичних осіб. Метою цього об’єднання було прагнення компаній,
                що займаються виробництвом та імпортом упаковки і товарів в упаковці,
                підвищити стандарти екологічної безпеки, впровадити в Україні
                європейський досвід поводження з відходами, розповсюдити основи сучасної
                споживчої культри у сфері поводження з упаковкою та її відходами.`
            }
        },
        {
            img: '/src/apps/client/ui/components/About/files/bottle.png',
            text: {
                ua: `Українська Пакувально-Екологічна Коаліція (УКРПЕК) була створена у 1999 році як некомерційне
                (неприбуткове) об’єднання юридичних осіб. Метою цього об’єднання було прагнення компаній,
                що займаються виробництвом та імпортом упаковки і товарів в упаковці, підвищити стандарти екологічної
                безпеки, впровадити в Україні європейський досвід поводження з відходами, розповсюдити основи
                сучасної споживчої культри у сфері поводження з упаковкою та її відходами.`,
                en: `Українська Пакувально-Екологічна Коаліція (УКРПЕК) була створена у 1999 році як некомерційне
                (неприбуткове) об’єднання юридичних осіб. Метою цього об’єднання було прагнення компаній,
                що займаються виробництвом та імпортом упаковки і товарів в упаковці,
                підвищити стандарти екологічної безпеки, впровадити в Україні європейський досвід поводження з відходами,
                розповсюдити основи сучасної споживчої культри у сфері поводження з упаковкою та її відходами.`
            }
        },
        {
            img: '/src/apps/client/ui/components/About/files/recycle.jpg',
            text: {
                ua: `Українська Пакувально-Екологічна Коаліція (УКРПЕК) була створена у 1999 році як некомерційне
                (неприбуткове) об’єднання юридичних осіб. Метою цього об’єднання було прагнення компаній,
                що займаються виробництвом та імпортом упаковки і товарів в упаковці,
                підвищити стандарти екологічної безпеки, впровадити в Україні європейський досвід поводження з відходами,
                розповсюдити основи сучасної споживчої культри у сфері поводження з упаковкою та її відходами.`,
                en: `Українська Пакувально-Екологічна Коаліція (УКРПЕК) була створена у 1999 році як некомерційне
                (неприбуткове) об’єднання юридичних осіб. Метою цього об’єднання було прагнення компаній,
                що займаються виробництвом та імпортом упаковки і товарів в упаковці,
                підвищити стандарти екологічної безпеки, впровадити в Україні європейський досвід поводження з відходами,
                розповсюдити основи сучасної споживчої культри у сфері поводження з упаковкою та її відходами.`
            }
        }
    ]
};

export default function (state = initialState, action) {
    switch (action.type) {
    case SET_ABOUT:
        return { ...state, aboutList: action.payload };
    default:
        return state;
    }
}
