/* eslint-disable max-len */

export default {
    menu: {
        main: 'Головна',
        about: 'Про нас',
        news: 'Новини',
        rvv: 'РВВ',
        laws: 'Законодавство',
        contacts: 'Контакти'
    },
    header: {
        phone: '+3 8095 456 56 55'
    },
    content: {
        title: 'РВВ - в дії',
        description: `Концепція створення ефективної системи збирання, сортування, рециклінгу та відновлення відходів упаковки`,
        buttonText: 'Детальніше',
        text: `Розширена відповідальність виробника (РВВ) - ефективний метод управління відходами упаковки, які складають до 30% ТПВ`
    },
    companies: {
        title: 'Учасники пілотного процесу'
    },
    articles: {
        title: 'Новини',
        articleContent: [
            {
                text: {
                    en: {
                        date: '12 березня 2019',
                        description: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК'
                    },
                    ua: {
                        date: '12 березня 2019',
                        description: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК'
                    }
                }
            },
            {
                text: {
                    en: {
                        date: '12 березня 2019',
                        description: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК'
                    },
                    ua: {
                        date: '12 березня 2019',
                        description: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК'
                    }
                }
            },
            {
                text: {
                    en: {
                        date: '12 березня 2019',
                        description: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК'
                    },
                    ua: {
                        date: '12 березня 2019',
                        description: 'У Європейському Союзі заборонили використання пластикових товарів – експертна оцінка УКРПЕК'
                    }
                }
            }
        ]
    }
};
