/* eslint-disable max-len */

export default {
    menu: {
        main: 'Головна',
        about: 'Про нас',
        news: 'Новини',
        rvv: 'РВВ',
        laws: 'Законодавство',
        contacts: 'Контакти'
    },
    header: {
        phone: '+3 8095 456 56 55'
    },
    content: {
        title: 'РВВ - в дії',
        description: `Концепція створення ефективної системи збирання, сортування, рециклінгу та відновлення відходів упаковки`,
        buttonText: 'Детальніше',
        text: `Розширена відповідальність виробника (РВВ) - ефективний метод управління відходами упаковки, які складають до 30% ТПВ`
    },
    companies: {
        title: 'Учасники пілотного процесу'
    },
    articles: {
        title: 'Новини'
    },
    about: {
        title: 'Про компанію',
        content: [
            {
                text: `Українська Пакувально-Екологічна Коаліція (УКРПЕК) була створена у 1999 році як некомерційне (неприбуткове) об’єднання юридичних осіб. Метою цього об’єднання було прагнення компаній, що займаються виробництвом та імпортом упаковки і товарів в упаковці, підвищити стандарти екологічної безпеки, впровадити в Україні європейський досвід поводження з відходами, розповсюдити основи сучасної споживчої культри у сфері поводження з упаковкою та її відходами.`
            },
            {
                text: `Особливим завданням УКРПЕК є пропагування відповідального ведення бізнесу, підтримка ініціатив виробників, які працюють на ринку України, щодо впровадження сучасних міжнародних стандартів у виробництво пакування для товарів повсякденного попиту (FMCG-товарів). Варто зазначити, що окрім суто екологічної складової цей процес значною мірою сприяє й розвитку економіки. Адже сьогодні більшість розвинених країн Європейського Союзу стали на шлях ресурсоощадної економіки – так званої економіки замкнутого циклу (Circular economy), що забезпечує розвиток ефективних систем збирання, сортування та переробки використаної упаковки.`
            },
            {
                text: `Не менш важливим також є законодавче забезпечення створення в Україні системи збирання й утилізації відходів упаковки. Коаліція сприяла розробці низки законопроектів щодо упаковки та відходів упаковки (2002 р., 2009 р., 2014 р. та 2016 р.).
                Зараз Українська Пакувально-Екологічна Коаліція співпрацює з міжнародними та вітчизняними бізнес-асоціаціями, галузевими об’єднаннями, суб’єктами господарювання в сфері поводження з відходами упаковки з метою пропаганди передового європейського досвіду й законодавчого забезпечення створення в Україні систем збирання та переробки відходів упаковки на засадах розширеної відповідальності виробника, які успішно функціонують у країнах ЄС.`
            }
        ]
    },
    contact: {
        title: `Контакты`,
        info: {
            workHours: {
                title: `Режим роботы:`,
                desc: `пн-пт 09.00 - 17.00`
            },
            adress: {
                street: `Улица Садовая 28`,
                index: `06040`,
                phone: `телефон: `,
                phoneNumber: `(093) 747 22 02`
            },
            city: {
                title: `Vyshgorod`,
                desc: `Lorem ipsum dolor sit amet, consectetuer adipiscing elit,
          sed diam nonummy nibh euismod tincidunt ut laoreet dolore`
            },
            mail: {
                title: `Почта УКРПЕК`,
                desc: `support@ukrpec.com`
            }
        }
    }
};
