/* eslint-disable max-len */

export default {
    menu: {
        main: 'Головна',
        about: 'Про нас',
        news: 'Новини',
        rvv: 'РВВ',
        laws: 'Законодавство',
        contacts: 'Контакти'
    },
    header: {
        phone: '+3 8095 456 56 55'
    },
    content: {
        title: 'РВВ - в дії',
        description: `Концепція створення ефективної системи збирання, сортування, рециклінгу та відновлення відходів упаковки`,
        buttonText: 'Детальніше',
        text: `Розширена відповідальність виробника (РВВ) - ефективний метод управління відходами упаковки, які складають до 30% ТПВ`
    },
    companies: {
        title: 'Учасники пілотного процесу'
    },
    articles: {
        title: 'Новини'
    },
    about: {
        title: 'Про компанію',
        content: [
            {
                text: `Українська Пакувально-Екологічна Коаліція (УКРПЕК) була створена у 1999 році як некомерційне (неприбуткове) об’єднання юридичних осіб. Метою цього об’єднання було прагнення компаній, що займаються виробництвом та імпортом упаковки і товарів в упаковці, підвищити стандарти екологічної безпеки, впровадити в Україні європейський досвід поводження з відходами, розповсюдити основи сучасної споживчої культри у сфері поводження з упаковкою та її відходами.`
            },
            {
                text: `Українська Пакувально-Екологічна Коаліція (УКРПЕК) була створена у 1999 році як некомерційне (неприбуткове) об’єднання юридичних осіб. Метою цього об’єднання було прагнення компаній, що займаються виробництвом та імпортом упаковки і товарів в упаковці, підвищити стандарти екологічної безпеки, впровадити в Україні європейський досвід поводження з відходами, розповсюдити основи сучасної споживчої культри у сфері поводження з упаковкою та її відходами.`
            },
            {
                text: `Українська Пакувально-Екологічна Коаліція (УКРПЕК) була створена у 1999 році як некомерційне (неприбуткове) об’єднання юридичних осіб. Метою цього об’єднання було прагнення компаній, що займаються виробництвом та імпортом упаковки і товарів в упаковці, підвищити стандарти екологічної безпеки, впровадити в Україні європейський досвід поводження з відходами, розповсюдити основи сучасної споживчої культри у сфері поводження з упаковкою та її відходами.`
            }
        ]
    }
};
